# 1. ვიქტორინა
# მომხმარებელს უნდა დავუსვათ კითხვა: “რომელი იმპერიის მიერ აგებული წყალ-მომარაგების სისტემა
# (აკვედუკი) ფუნქციონირებს დღესაც?”
# სავარაუდო პასუხები: შუმერთა, სელჩუკთა, რომის, მონღოლთა
# მომხმარებელმა უნდა შეიყვანოს სწორი პასუხის ნომერი ან თავად სწორი პასუხი.
# შეცდომის შემთხვევაში იბეჭდება: „არა! სწორი პასუხია რომის!“
# სწორი პასუხის შემთხვევაში იბეჭდება: „სწორია!“

user = str(input("""რომელი იმპერიის მიერ აგებული წყალ-მომარაგების სისტემა (აკვედუკი) ფუნქციონირებს დღესაც?
სავარაუდო პასუხები:
1. შუმერთა
2. სელჩუკთა
3. რომის
4. მონღოლთა
"""))
if user in {"3", "3.", "3)", "რომის", "romis", "Romis"}:
    print(" სწორია! ")
else:
   print (" არა! სწორი პასუხია რომის! ")


# 2. ონლაინ მაღაზია
# პროგრამა გთავაზობს პროდუქტის სამ კატეგორიას: ლეპტოპები, პერსონალური კომპიუტერები, მობილურები
# მომხმარებელი ირჩევს ერთ-ერთს.
# პროგრამა ითხოვს მაქსიმალურ ბიუჯეტს და ბიუჯეტის მიხედვით სთავაზობს მომხმარებელს კონკრეტულ მოდელს არჩეულ კატეგორიაში.
# (თითო კატეგორიაში მინიმუმ 3 პროდუქტი მაინც უნდა იყოს)
# თუ ბიუჯეტი ძალიან მცირეა, პროგრამა ბეჭდავს, რომ ამ თანხაში არ გააჩნია შემოთავაზება.


Category = str(input("""გთხოვთ აირჩიოთ კატეგორია:
1. ლეპტოპები
2. პერსონალური კომპიუტერები
3. მობილურები
"""))
if Category not in { "1", "ლეპტოპები","2", "პერსონალური კომპიუტერები","3", "მობილურები" }:
    print( " გთხოვთ, შეიყვანოთ კატეგორიის სწორი დასახელება!  ")
else:
    budget = int( input(" თქვენი მაქსიმალური ბიუჯეტი: "))
    if Category in {"1", "ლეპტოპები"}:
        if budget < 800:
            print("ამ თანხაში არ გვაქვს შემოთავაზება")
        elif budget > 3000:
            print(" Hp1, Hp2, Asus1, Asus2, Asus3, Macbook ")
        elif budget > 1500:
            print (" Hp1, Hp2, Asus1, Asus2")
        else:
            print(" Hp1, Hp2 ")
    if Category in {"2", "პერსონალური კომპიუტერები"}:
        if budget < 900:
            print("ამ თანხაში არ გვაქვს შემოთავაზება")
        elif budget > 3500:
            print (" lenovo1, lenovo2, Apple1, Asus4, Asus5 ")
        elif budget > 2800:
            print(" lenovo1, lenovo2, Asus4 ")
        elif budget > 1500:
            print(" lenovo1, lenovo2 ")
        else:
            print(" lenovo1 ")
    if Category in {"3", "მობილურები"}:
        if budget < 1700:
            print("ამ თანხაში არ გვაქვს შემოთავაზება")
        elif budget > 2500:
            print (" Iphone15, Iphone14, Iphone 13 ")
        elif budget > 2200:
            print(" Iphone14, Iphone13")
        else:
            print(" Iphone 13 ")



# 3. ქუესთის შედგენა (Text Based Adventure Game)
# დაწერე ერთმანეთში ჩასმული if-else კონსტრუქციების
# გამოყენებით მარტივი ტექსტზე დაფუძნებული სათავგადასავლო თამაში.
# მაგ. თავიდან პროგრამა ბეჭდავს მომხმარებლის ადგილსამყოფელს და სთავაზობს მქომედების რამდენიმე ვარიანტს.
# სხვადასხვა არჩევანის შემთხვევაში თამაში სხვადასხვანაირად ვითარდება.

kari = int(input ( """ხედავთ 3 კარს. აქედან ერთ-ერთ ოთახში საგანძურია და შეგიძლიათ მოიგოთ განძი.
გთხოვთ აირჩიოთ კარის ნომერი: 1,2,3 
""" ))
if kari not in {1,2,3}:
    print ("ასეთი კარის ნომერი არაა. შეგიძლიათ თავიდან დაიწყოთ თამაში")
else:
    if kari == 1:
        gasagebi = input ("ახლა ხედავთ საგანძურს და 5 გასაღებს. აქედან მხოლოდ ერთს შეუძლია მისი გახსნა"
                          "დაასახელეთ გასაღების სახელი: A,B,C,D,E ").lower()
        if gasagebi not in {"a","b","c","d","e"}:
            print("ასეთი გასაღები არ არსებობს. შეგიძლიათ თავიდან დაიწყოთ თამაში ")
        elif gasagebi == "e":
            print("გილოცავთ, თქვენ შეგიძლიათ გახსნათ საგანძური!")
        else:
            print( "სამწუხაროდ ეს გასაღები არ ხსნის საგანძურს. თამაშის დასასრული. ")
    else:
        print ("სამწუხაროთ ამ კარში არ არის საგანძური. თამაშის დასასრული. ")
